src/Documents/bz_ВыставлениеРабот/bz_ВыставлениеРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>bz_ВыставлениеРабот</name>
  <registerRecords>AccumulationRegister.bz_СписанныеТрудозатраты</registerRecords>
  <registerRecords>AccumulationRegister.bz_РаботыКВыставлению</registerRecords>
  <registerRecords>AccumulationRegister.bz_Выработка</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.bz_Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыработкаПрошлыхПериодов</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.bz_ЭтапыПроектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.bz_Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОтработано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОтработано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВыставлено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСписано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВыставлено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПервичныйДокумент</name>
      <type>
        <types>DocumentRef.bz_ВыставлениеРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиПервичногоДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Выработка</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.bz_ЭтапыПроектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.bz_Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСодержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьПримечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВыставлено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСписано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзмененаВручную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПВР</name>
      <type>
        <types>CatalogRef.bz_ПозицияВыполненияРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределениеВыработки</name>
    <attributes>
      <name>КлючСтрокиВыработки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.bz_ВариантыВыставленияОтработанногоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.bz_ПричиныСписанияТрудозатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/bz_ВыставлениеРабот/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр bz_ВыставленныеРаботы Приход
	Движения.bz_ВыставленныеРаботы.Записывать = Истина;
	Для Каждого ТекСтрокаТекущаяВыработка Из Выработка Цикл
		Если ТекСтрокаТекущаяВыработка.Количество - ТекСтрокаТекущаяВыработка.КоличествоВыставлено - ТекСтрокаТекущаяВыработка.КоличествоСписано < 0 Тогда 
			ТекстСообщения = НСтр("ru='Отработанное время должно быть не меньше, чем выставленное и списанное вместе'");
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст 		= ТекстСообщения;
			Сообщение.Поле 			= "Выработка[" + Формат(ТекСтрокаТекущаяВыработка.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].КоличествоОтработано";
			Сообщение.ПутьКДанным 	= "Объект";
			Сообщение.Сообщить();
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.bz_ВыставленныеРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Проект = Проект;
		Движение.Этап = ТекСтрокаТекущаяВыработка.Этап;
		Движение.Работа = ТекСтрокаТекущаяВыработка.Работа;
		Движение.Сотрудник = ТекСтрокаТекущаяВыработка.Сотрудник;
		Движение.Документ = Ссылка;
		Движение.НомерСтр = ТекСтрокаТекущаяВыработка.НомерСтроки;
		Движение.КоличествоОтработано = ТекСтрокаТекущаяВыработка.Количество;
		Движение.Сумма = ТекСтрокаТекущаяВыработка.Сумма;
		
		Если ТекСтрокаТекущаяВыработка.КоличествоВыставлено + ТекСтрокаТекущаяВыработка.КоличествоСписано > 0 Тогда
			Движение = Движения.bz_ВыставленныеРаботы.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Проект = Проект;
			Движение.Этап = ТекСтрокаТекущаяВыработка.Этап;
			Движение.Работа = ТекСтрокаТекущаяВыработка.Работа;
			Движение.Сотрудник = ТекСтрокаТекущаяВыработка.Сотрудник;
			Движение.Документ = Ссылка;
			Движение.НомерСтр = ТекСтрокаТекущаяВыработка.НомерСтроки;
			Движение.КоличествоОтработано = ТекСтрокаТекущаяВыработка.КоличествоВыставлено + ТекСтрокаТекущаяВыработка.КоличествоСписано;
			Если ТекСтрокаТекущаяВыработка.Количество <> 0 Тогда
				Движение.Сумма = ТекСтрокаТекущаяВыработка.Сумма/ТекСтрокаТекущаяВыработка.Количество*Движение.КоличествоОтработано;
			КонецЕсли;
		КонецЕсли;
		Если ТекСтрокаТекущаяВыработка.КоличествоВыставлено > 0 Тогда
			Движение = Движения.bz_ВыставленныеРаботы.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Проект = Проект;
			Движение.Этап = ТекСтрокаТекущаяВыработка.Этап;
			Движение.Работа = ТекСтрокаТекущаяВыработка.Работа;
			Движение.Сотрудник = ТекСтрокаТекущаяВыработка.Сотрудник;
			Движение.КоличествоКВыставлению = ТекСтрокаТекущаяВыработка.КоличествоВыставлено;
			Движение.Документ = Ссылка;
			Движение.НомерСтр = ТекСтрокаТекущаяВыработка.НомерСтроки;
			Если ТекСтрокаТекущаяВыработка.Количество <> 0 Тогда
				Движение.СуммаКВыставлению = ТекСтрокаТекущаяВыработка.Сумма/ТекСтрокаТекущаяВыработка.Количество*ТекСтрокаТекущаяВыработка.КоличествоВыставлено;
			КонецЕсли;
		КонецЕсли;
		Если ТекСтрокаТекущаяВыработка.КоличествоСписано > 0 Тогда
			Движение = Движения.bz_ВыставленныеРаботы.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Проект = Проект;
			Движение.Этап = ТекСтрокаТекущаяВыработка.Этап;
			Движение.Работа = ТекСтрокаТекущаяВыработка.Работа;
			Движение.Сотрудник = ТекСтрокаТекущаяВыработка.Сотрудник;
			Движение.КоличествоСписано = ТекСтрокаТекущаяВыработка.КоличествоСписано;
			Движение.Документ = Ссылка;
			Движение.НомерСтр = ТекСтрокаТекущаяВыработка.НомерСтроки;
			Если ТекСтрокаТекущаяВыработка.Количество <> 0 Тогда
				Движение.СуммаКВыставлению = ТекСтрокаТекущаяВыработка.Сумма/ТекСтрокаТекущаяВыработка.Количество*ТекСтрокаТекущаяВыработка.КоличествоСписано;
			КонецЕсли;
			
			ДвижениеРасход = Движения.bz_ВыставленныеРаботы.Добавить();
			ЗаполнитьЗначенияСвойств(ДвижениеРасход, Движение);
			ДвижениеРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
		КонецЕсли;
	КонецЦикла;
	
	Движения.bz_ВыставленныеРаботы.Записывать = Истина;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
